# StairsMultistoryTopLevelParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsMultistoryTopLevelParam Property
ParameterTypeId Class See Also
---
"Multistory Top Level"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsMultistoryTopLevelParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsMultistoryTopLevelParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsMultistoryTopLevelParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace